In [1]:
import pandas as pd                       
ser_obj = pd.Series([1, 2, 3, 4, 5])      
ser_obj

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [2]:
ser_obj = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
ser_obj

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [3]:
year_data = {2001: 17.8, 2002: 20.1, 2003: 16.5}
ser_obj2 = pd.Series(year_data)   
ser_obj2

2001    17.8
2002    20.1
2003    16.5
dtype: float64

In [4]:
ser_obj.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [5]:
ser_obj.values

array([1, 2, 3, 4, 5], dtype=int64)

In [6]:
ser_obj[3]

4

In [7]:
ser_obj * 2

a     2
b     4
c     6
d     8
e    10
dtype: int64

In [8]:
import numpy as np
import pandas as pd
demo_arr = np.array([['a', 'b', 'c'], ['d', 'e', 'f']]) 
df_obj = pd.DataFrame(demo_arr)   
df_obj

   0  1  2
0  a  b  c
1  d  e  f

In [9]:
df_obj = pd.DataFrame(demo_arr, columns=['No1', 'No2', 'No3'])
df_obj

  No1 No2 No3
0   a   b   c
1   d   e   f

In [10]:
element = df_obj['No2']  
element

0    b
1    e
Name: No2, dtype: object

In [11]:
type(element)

pandas.core.series.Series

In [12]:
element = df_obj.No2  
element

0    b
1    e
Name: No2, dtype: object

In [13]:
type(element)

pandas.core.series.Series

In [14]:
df_obj['No4'] = ['g', 'h']
df_obj

  No1 No2 No3 No4
0   a   b   c   g
1   d   e   f   h

In [15]:
del df_obj['No3']
df_obj

  No1 No2 No4
0   a   b   g
1   d   e   h

In [16]:
import pandas as pd
ser_obj = pd.Series(range(5), index=['a','b','c','d','e'])
ser_index = ser_obj.index
ser_index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [18]:
ser_obj1 = pd.Series(range(3), index=['a','b','c'])
ser_obj2 = pd.Series(['a','b','c'], index=ser_obj1.index)
ser_obj2.index is ser_obj1.index

True

In [19]:
import pandas as pd
ser_obj = pd.Series([1, 2, 3, 4, 5], index=['c', 'd', 'a', 'b', 'e'])
ser_obj

c    1
d    2
a    3
b    4
e    5
dtype: int64

In [20]:
ser_obj2 = ser_obj.reindex(['a', 'b', 'c', 'd', 'e', 'f']) 
ser_obj2

a    3.0
b    4.0
c    1.0
d    2.0
e    5.0
f    NaN
dtype: float64

In [21]:
ser_obj2 = ser_obj.reindex(['a', 'b', 'c', 'd', 'e', 'f'], fill_value = 6)
ser_obj2

a    3
b    4
c    1
d    2
e    5
f    6
dtype: int64

In [22]:
ser_obj3 = pd.Series([1, 3, 5, 7], index=[0, 2, 4, 6])
ser_obj3

0    1
2    3
4    5
6    7
dtype: int64

In [23]:
ser_obj3.reindex(range(6), method = 'ffill')

0    1
1    1
2    3
3    3
4    5
5    5
dtype: int64

In [24]:
ser_obj3.reindex(range(6), method = 'bfill')

0    1
1    3
2    3
3    5
4    5
5    7
dtype: int64

In [25]:
import pandas as pd
ser_obj = pd.Series([1, 2, 3, 4, 5], index=['a', 'b', 'c', 'd', 'e'])
ser_obj[2]

3

In [26]:
ser_obj['c']

3

In [27]:
ser_obj[2: 4]

c    3
d    4
dtype: int64

In [28]:
ser_obj['c': 'e']

c    3
d    4
e    5
dtype: int64

In [29]:
ser_obj[[0, 2, 4]]

a    1
c    3
e    5
dtype: int64

In [30]:
ser_obj[['a', 'c', 'd']]

a    1
c    3
d    4
dtype: int64

In [31]:
ser_bool = ser_obj > 2         
ser_bool

a    False
b    False
c     True
d     True
e     True
dtype: bool

In [32]:
ser_obj[ser_bool]

c    3
d    4
e    5
dtype: int64

In [33]:
arr = np.arange(12).reshape(3, 4)
df_obj = pd.DataFrame(arr, columns=['a', 'b', 'c', 'd'])
df_obj

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [34]:
df_obj['b']

0    1
1    5
2    9
Name: b, dtype: int32

In [35]:
type(df_obj['b'])

pandas.core.series.Series

In [36]:
df_obj[['b', 'd']]

   b   d
0  1   3
1  5   7
2  9  11

In [37]:
df_obj[: 2]

   a  b  c  d
0  0  1  2  3
1  4  5  6  7

In [38]:
df_obj[: 3][['b', 'd']]

   b   d
0  1   3
1  5   7
2  9  11

In [39]:
arr = np.arange(16).reshape(4, 4)
dataframe_obj = pd.DataFrame(arr, columns=['a', 'b', 'c', 'd'])
dataframe_obj

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [40]:
dataframe_obj.loc[:, ["c", "a"]]

    c   a
0   2   0
1   6   4
2  10   8
3  14  12

In [41]:
dataframe_obj.iloc[:, [2, 0]]

    c   a
0   2   0
1   6   4
2  10   8
3  14  12

In [42]:
dataframe_obj.loc[1:2, ['b','c']]

   b   c
1  5   6
2  9  10

In [43]:
dataframe_obj.iloc[1:3, [1, 2]]

   b   c
1  5   6
2  9  10

In [44]:
obj_one = pd.Series(range(10, 13), index=range(3)) 
obj_one

0    10
1    11
2    12
dtype: int64

In [45]:
obj_two = pd.Series(range(20, 25), index=range(5))
obj_two

0    20
1    21
2    22
3    23
4    24
dtype: int64

In [46]:
obj_one + obj_two

0    30.0
1    32.0
2    34.0
3     NaN
4     NaN
dtype: float64

In [47]:
obj_one.add(obj_two, fill_value = 0)

0    30.0
1    32.0
2    34.0
3    23.0
4    24.0
dtype: float64

In [48]:
import pandas as pd
ser_obj = pd.Series(range(10, 15), index=[5, 3, 1, 3, 2])
ser_obj

5    10
3    11
1    12
3    13
2    14
dtype: int64

In [49]:
ser_obj.sort_index()

1    12
2    14
3    11
3    13
5    10
dtype: int64

In [50]:
ser_obj.sort_index(ascending = False)

5    10
3    11
3    13
2    14
1    12
dtype: int64

In [51]:
import pandas as pd
import numpy as np
df_obj = pd.DataFrame(np.arange(9).reshape(3, 3), index=[4, 3, 5])
df_obj

   0  1  2
4  0  1  2
3  3  4  5
5  6  7  8

In [52]:
df_obj.sort_index()

   0  1  2
3  3  4  5
4  0  1  2
5  6  7  8

In [53]:
df_obj.sort_index(ascending = False)

   0  1  2
5  6  7  8
4  0  1  2
3  3  4  5

In [54]:
ser_obj = pd.Series([4, np.nan, 6, np.nan, -3, 2])
ser_obj

0    4.0
1    NaN
2    6.0
3    NaN
4   -3.0
5    2.0
dtype: float64

In [55]:
ser_obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    6.0
1    NaN
3    NaN
dtype: float64

In [56]:
df_obj = pd.DataFrame([[0.4, -0.1, -0.3, 0.0], 
                       [0.2, 0.6, -0.1, -0.7],
                       [0.8, 0.6, -0.5, 0.1]])
df_obj

     0    1    2    3
0  0.4 -0.1 -0.3  0.0
1  0.2  0.6 -0.1 -0.7
2  0.8  0.6 -0.5  0.1

In [57]:
df_obj.sort_values(by = 2)

     0    1    2    3
2  0.8  0.6 -0.5  0.1
0  0.4 -0.1 -0.3  0.0
1  0.2  0.6 -0.1 -0.7

In [58]:
df_obj = pd.DataFrame(np.arange(12).reshape(3, 4), columns=['a', 'b', 'c', 'd'])
df_obj

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [59]:
df_obj.sum()

a    12
b    15
c    18
d    21
dtype: int64

In [60]:
df_obj.max()

a     8
b     9
c    10
d    11
dtype: int32

In [61]:
df_obj.min(axis=1)

0    0
1    4
2    8
dtype: int32

In [62]:
df_obj = pd.DataFrame([[12, 6, -11, 19], 
                       [-1, 7, 50, 36],
                       [5, 9, 23, 28]])
df_obj

    0  1   2   3
0  12  6 -11  19
1  -1  7  50  36
2   5  9  23  28

In [63]:
df_obj.describe()

               0         1          2          3
count   3.000000  3.000000   3.000000   3.000000
mean    5.333333  7.333333  20.666667  27.666667
std     6.506407  1.527525  30.566867   8.504901
min    -1.000000  6.000000 -11.000000  19.000000
25%     2.000000  6.500000   6.000000  23.500000
50%     5.000000  7.000000  23.000000  28.000000
75%     8.500000  8.000000  36.500000  32.000000
max    12.000000  9.000000  50.000000  36.000000

In [64]:
import numpy as np
import pandas as pd
mulitindex_series = pd.Series([15848,13472,12073.8,7813,7446,6444,15230,8269],
                              index=[['','','','',
                                      '','','',''],
                                     ['','','','',
                                      '','','','']])
mulitindex_series

      15848.0
          13472.0
          12073.8
          7813.0
        7446.0
           6444.0
          15230.0
           8269.0
dtype: float64

In [65]:
import pandas as pd
from pandas import DataFrame,Series
mulitindex_df = DataFrame({'':[15848,13472,12073.8,7813,
                                   7446,6444,15230,8269]},
                          index=[['','','','',
                                  '','','',''],
                                 ['','','','',
                                  '','','','']])
mulitindex_df

   15848.0
       13472.0
       12073.8
       7813.0
     7446.0
        6444.0
       15230.0
        8269.0

In [66]:
from pandas import MultiIndex
list_tuples = [('A','A1'), ('A','A2'), ('B','B1'),
               ('B','B2'), ('B','B3')]
multi_index = MultiIndex.from_tuples(tuples=list_tuples, 
                                     names=[ '', ''])
multi_index

MultiIndex(levels=[['A', 'B'], ['A1', 'A2', 'B1', 'B2', 'B3']],
           labels=[[0, 0, 1, 1, 1], [0, 1, 2, 3, 4]],
           names=['', ''])

In [67]:
import pandas as pd
values = [[1, 2, 3], [8, 5, 7], [4, 7, 7], [5, 5, 4], [4, 9, 9]]
df_indexs = pd.DataFrame(data=values, index=multi_index)
df_indexs

           0  1  2

A    A1    1  2  3
     A2    8  5  7
B    B1    4  7  7
     B2    5  5  4
     B3    4  9  9

In [68]:
from pandas import MultiIndex
multi_array = MultiIndex.from_arrays(arrays =[['A', 'B', 'A', 'B', 'B'], 
                                              ['A1', 'A2', 'B1', 'B2', 'B3']],
                                     names=['',''])
multi_array

MultiIndex(levels=[['A', 'B'], ['A1', 'A2', 'B1', 'B2', 'B3']],
           labels=[[0, 1, 0, 1, 1], [0, 1, 2, 3, 4]],
           names=['', ''])

In [69]:
import pandas as pd
import numpy as np
values = np.array([[1, 2, 3], [8, 5, 7], [4, 7, 7],
                   [5, 5, 4], [4, 9, 9]])
df_array = pd.DataFrame(data=values, index=multi_array)
df_array

           0  1  2

A    A1    1  2  3
B    A2    8  5  7
A    B1    4  7  7
B    B2    5  5  4
     B3    4  9  9

In [70]:
from pandas import MultiIndex
import pandas as pd
numbers = [0, 1, 2]
colors = ['green', 'purple']
multi_product = pd.MultiIndex.from_product([numbers, colors], 
                                           names=['number', 'color'])
multi_product

MultiIndex(levels=[[0, 1, 2], ['green', 'purple']],
           labels=[[0, 0, 1, 1, 2, 2], [0, 1, 0, 1, 0, 1]],
           names=['number', 'color'])

In [71]:
import pandas as pd
values = np.array([[7, 5], [6, 6], [3, 1], [5, 5], [4, 5], [5, 3]])
df_product = pd.DataFrame(data=values, index=multi_product)
df_product

               0  1
number color
0      green   7  5
       purple  6  6
1      green   3  1
       purple  5  5
2      green   4  5
       purple  5  3

In [72]:
from pandas import Series, DataFrame
ser_obj = Series([50, 60, 40, 94, 63, 101, 200, 56, 45],
                 index=[['', '', '',
                         '', '', '',
                         '', '', ''],
                        ['', '', '',
                         '', '', '',
                         '', '', '']])
ser_obj

         50
             60
              40
            94
              63
             101
             200
              56
               45
dtype: int64

In [73]:
ser_obj['']

    50
      60
       40
dtype: int64

In [74]:
ser_obj[:,'']

    101
dtype: int64

In [75]:
ser_obj.swaplevel()

         50
           60
            40
            94
          63
         101
             200
            56
             45
dtype: int64

In [2]:
from pandas import DataFrame,Series
df_obj = DataFrame({'str':['a','b','d','e','f','k','d','s','l'],
                    'num':[1, 2, 4, 5, 3, 2, 6, 2, 3]},
                   index=[['A', 'A', 'A', 'C', 'C', 'C', 'B', 'B', 'B'],
                          [1, 3, 2, 3, 1, 2, 4, 5, 8]])
df_obj

    str  num
A 1   a    1
  3   b    2
  2   d    4
C 3   e    5
  1   f    3
  2   k    2
B 4   d    6
  5   s    2
  8   l    3

In [3]:
df_obj.sort_index()

    str  num
A 1   a    1
  2   d    4
  3   b    2
B 4   d    6
  5   s    2
  8   l    3
C 1   f    3
  2   k    2
  3   e    5

In [4]:
df_obj.sort_index(by='num',ascending=False)

D:\anaconda\lib\site-packages\ipykernel_launcher.py:2: FutureWarning: by argument to sort_index is deprecated, please use .sort_values(by=...)

    str  num
B 4   d    6
C 3   e    5
A 2   d    4
C 1   f    3
B 8   l    3
A 3   b    2
C 2   k    2
B 5   s    2
A 1   a    1

In [7]:
import pandas as pd
import requests
html_data = requests.get('http://kaoshi.edu.sina.com.cn/college/majorlist/')
html_table_data = pd.read_html(html_data.content,encoding='utf-8')
html_table_data[1]

           0       1     2     3          4
0
1            0101
2           010101
3          010102
4          010103
5          010104
6           0201
7          020101
8        020102
9       020103
10    020104
11       020105
12        020106
13       020107
14        020108
15        020109
16          0202
17         020201
18         020202
19          0203
20         020301

In [9]:
import pandas as pd
file_path = 'C:/Users/12583/Desktop/scores.xlsx'
df_obj = pd.read_excel(file_path, header=[0, 1])
df_obj

   Unnamed: 0_level_0
   Unnamed: 0_level_1
0                2018   576  532   488  432
1                2017   555  537   468  439
2                2016   583  548   532  494
3                2015   579  548   527  495
4                2014   565  543   507  495
5                2013   549  550   494  505
6                2012   495  477   446  433
7                2011   524  484   481  435
8                2010   524  494   474  441
9                2009   532  501   489  459
10               2008   515  502   472  455
11               2007   528  531   489  478
12               2006   516  528   476  476

In [10]:
sorted_obj = df_obj.sort_index(ascending = False)
sorted_obj

   Unnamed: 0_level_0
   Unnamed: 0_level_1
12               2006   516  528   476  476
11               2007   528  531   489  478
10               2008   515  502   472  455
9                2009   532  501   489  459
8                2010   524  494   474  441
7                2011   524  484   481  435
6                2012   495  477   446  433
5                2013   549  550   494  505
4                2014   565  543   507  495
3                2015   579  548   527  495
2                2016   583  548   532  494
1                2017   555  537   468  439
0                2018   576  532   488  432

In [11]:
sorted_obj.max()

Unnamed: 0_level_0  Unnamed: 0_level_1    2018
                                    583
                                         550
                                    532
                                         505
dtype: int64

In [12]:
sorted_obj.min()

Unnamed: 0_level_0  Unnamed: 0_level_1    2006
                                    495
                                         477
                                    446
                                         432
dtype: int64

In [13]:
result1 = sorted_obj["", ""].ptp()
result1

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
  """Entry point for launching an IPython kernel.

88

In [14]:
result2 = sorted_obj["", ""].ptp()  
result2

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
  """Entry point for launching an IPython kernel.

73

In [15]:
result3 = sorted_obj["", ""].ptp()  
result3

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
  """Entry point for launching an IPython kernel.

86

In [21]:
result4 = sorted_obj["", ""].ptp()  
result4

D:\anaconda\lib\site-packages\ipykernel_launcher.py:1: FutureWarning: Method .ptp is deprecated and will be removed in a future version. Use numpy.ptp instead.
  """Entry point for launching an IPython kernel.

73